package homework3;

public class Task2 {

    public static void main(String[] args) {
//      Вывести в консоль все числа от 40 до 20 включительно в порядке убывания.
        for (int a = 40; a >= 20; a--){
            System.out.println(a);
        }
    }
}
